In [1]:
# series object in pandas

In [3]:
import pandas as pd
data = [1,2,3,4]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
type(series1)

pandas.core.series.Series

In [5]:
#changing the index of a series object
series1 = pd.Series(data,index = ['a','b','c','d'])
series1

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
#how to create dataframe
# creating a dataframe using a list
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
#creating a dataframe using a dictionary
dictionary = {'cars':['lamborgini','audi','bmw'],'count':[10,20,15]}
df = pd.DataFrame(dictionary)
df

         cars  count
0  lamborgini     10
1        audi     20
2         bmw     15

In [9]:
#creating dataframe using series
df = pd.DataFrame(series1)
df

   0
a  1
b  2
c  3
d  4

In [10]:
#creating DataFrame using a numpy array
import numpy as np
numpyarray = np.array([[50000,60000],['satyam','arpit']])
df = pd.DataFrame({'name':numpyarray[1],'salary':numpyarray[0]})
df

     name salary
0  satyam  50000
1   arpit  60000

# how to perform a merge operation